nxp-mcuxpresso/mcuxsdk-examples/wireless_examples/ble_controller/hci_bb_mcxw23/hci_bb/datapump.c
/**
 * Copyright 2018-2025 NXP.
 * NXP Confidential and Proprietary.
 * This software is owned or controlled by NXP and may only be used
 * strictly in accordance with the applicable license terms.  By expressly
 * accepting such terms or by downloading, installing, activating and/or
 * otherwise using the software, you are agreeing that you have read, and
 * that you agree to comply with and are bound by, such license terms.  If
 * you do not agree to be bound by the applicable license terms, then you
 * may not retain, install, activate or otherwise use the software.
 */

#include <stddef.h>
#include "fsl_ctimer.h"
#include "hci_uart.h"
#include "hci_transport.h"
#include "hci.h"
#include "event_manager.h"
#include "fsl_debug_console.h"
#include "ll_mem.h"
#include "hci_custom_cmds.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* List of custom HCI commands needed by datapump */
typedef enum
{
    HCI_OCF_DATAPUMP_ENABLE      = 0x1E,
    HCI_OCF_DATAPUMP_DISABLE     = 0x1F,
    HCI_OCF_DATAPUMP_TRANSMIT    = 0x20,
    HCI_OCF_DATAPUMP_RECEIVE     = 0x21,
    HCI_OCF_DATAPUMP_READ_REPORT = 0x22,
    HCI_OCF_DATAPUMP_END         = 0x23
} hci_custom_commands_data_pump_t;

#define MAX_ACL_DATA_BUFFER (8)
#define MAX_CONN            (4)
#define NUMBER_OF_COMPLETED_PACKETS_EVENT (0x13)
#define DISCONNECT_COMPLETE_EVENT         (0x5)
#define PAYLOAD_TYPE_RANDOM_LENGTH (0x1)
#define PAYLOAD_PATTERN_RANDOM_DATA (0x1)
#define PAYLOAD_FREQUENCY_PERIODIC (0x2)
#define MIN_REPORT_INTERVAL (0x1f4 * 1000)   // 500 ms
#define MAX_REPORT_INTERVAL (0x493E0 * 1000) // 5 minutes
#define MAX_TIMER_CHANNELS (4)
#define NO_TIMER_EVENT     (0)
#define HCI_ACL   (2)
#define HCI_EVENT (4)

#define DIFF(x, y) (x > y ? x - y : y - x)

/* Support of the little endian format */
#define READ_2_BYTES(pckt, pos) (((uint16_t)(pckt)[pos]) | (((uint16_t)(pckt)[(pos) + 1]) << 8))

#define READ_3_BYTES(pckt, pos) \
    (((uint32_t)(pckt)[pos]) | (((uint32_t)(pckt)[pos + 1]) << 8) | (((uint32_t)(pckt)[pos + 2]) << 16))

#define READ_4_BYTES(pckt, pos)                                                                           \
    (((uint32_t)(pckt)[pos]) | (((uint32_t)(pckt)[pos + 1]) << 8) | (((uint32_t)(pckt)[pos + 2]) << 16) | \
     (((uint32_t)(pckt)[pos + 3]) << 24))

/* Write bytes to memory macro like function */
#define WRITE_2_BYTES(pckt, pos, var)                                  \
    do                                                                 \
    {                                                                  \
        ((uint8_t *)pckt)[pos]     = (uint8_t)(var);                   \
        ((uint8_t *)pckt)[pos + 1] = (uint8_t)(((var) & 0xff00) >> 8); \
    } while (0)

#define WRITE_3_BYTES(pckt, pos, var)                        \
    do                                                       \
    {                                                        \
        ((uint8_t *)pckt)[pos]     = (uint8_t)(var);         \
        ((uint8_t *)pckt)[pos + 1] = (uint8_t)((var) >> 8);  \
        ((uint8_t *)pckt)[pos + 2] = (uint8_t)((var) >> 16); \
    } while (0)

#define WRITE_4_BYTES(pckt, pos, var)                        \
    do                                                       \
    {                                                        \
        ((uint8_t *)pckt)[pos]     = (uint8_t)(var);         \
        ((uint8_t *)pckt)[pos + 1] = (uint8_t)((var) >> 8);  \
        ((uint8_t *)pckt)[pos + 2] = (uint8_t)((var) >> 16); \
        ((uint8_t *)pckt)[pos + 3] = (uint8_t)((var) >> 24); \
    } while (0)

typedef struct /*!< Internal info we pack into the data range of the ACL packet. */
{
    uint32_t sequenceNumber; /*!< Sequence number; always incrementing. */
    uint32_t sentTimestamp;  /*!< Timestamp of submission (sender). */
} packet_info_t;

typedef struct
{
    uint8_t lc;                     /*!< Logical channel byte preceding the command */
    uint16_t connectionHandle : 12; /*!< Connection handle of a ACL packet */
    uint16_t PB_Flag : 2;           /*!< Packet boundary flag */
    uint16_t BC_Flag : 2;           /*!< Broadcast flag of a ACL packet */
    uint16_t dataTotalLength;       /*!< The total length of a ACL packet */
    uint8_t pad[2];                 /* To ensure proper alignment of packetInfo. */
    packet_info_t packetInfo;
    uint8_t data[251 - 2 - sizeof(packet_info_t)]; /*!< Array containing the data for an ACL packet */
} __attribute__((packed, aligned(4))) acl_packet_t;

typedef struct
{
    uint8_t lc;
    uint8_t eventCode;
    uint8_t length;
    uint8_t numHandles;
    uint16_t connHandle;
    uint16_t numCompletedPackets;
} completed_packets_t;

typedef struct
{
    uint8_t lc;
    uint8_t eventCode;
    uint8_t length;
    uint8_t status;
    uint16_t connHandle;
    uint8_t reason;
} disconnect_complete_t;

typedef enum
{
    kNotInUse       = 0, /* The entry is not being used. */
    kReceiveContext  = 1, /* The entry is being used as a receive_params_t type. */
    kTransmitContext = 2, /* The entry is being used as a transmit_params_t type. */
} context_type_t;

typedef struct
{
    uint16_t connHandle;
    uint8_t type;
    uint8_t pattern;
    uint8_t frequency;
    uint16_t length;
    uint32_t numPackets;
    uint32_t numPacketsSend;
    uint16_t interval;
    uint16_t delay;
    uint8_t credits;
    uint8_t timerId;
    uint8_t stopTransmit;
} transmit_params_t;

typedef struct
{
    uint16_t connHandle;
    uint8_t timerId;
    uint32_t reportInterval; /* in milliseconds */
    uint32_t numPackets;
    uint32_t numberOfBytes; /* accumulated number of bytes received since first ACL packet or last report; used for
                               calculating throughput */
    uint32_t timestamp;     /* The timestamp is used to calculate the throughput, it is set when the first ACL packet is
                               received or a status report is generated; in microseconds */
    uint32_t expSequenceNumber; /* Expected sequence number. */
} receive_params_t;

