nxp-mcuxpresso/mcuxsdk-examples/wireless_examples/ble_controller/hci_bb_mcxw23/hci_bb/datapump.c
/*
 * The available transmit and receive contexts are kept in a generic
 * array s_contexts below. As long as the contexts are not used, the inUse flag
 * is clear; as soon as they are allocated, the inUse flag resembles their function
 * and is determined by the context_type_t value.
 */
typedef struct
{
    uint8_t inUse; /* One of the context_type_t values. */
    union
    {
        transmit_params_t transmit;
        receive_params_t receive;
    };
} datapump_context_t;

typedef enum
{
    kDATAPUMP_CTIMER_0 = 0,
    kDATAPUMP_CTIMER_1,
    kDATAPUMP_CTIMER_2,
    kDATAPUMP_CTIMER_MAX,
} datapump_ctimer_id_t;

typedef struct __attribute__((packed)) _datapump_transmit_parameters
{
    uint16_t connHandle;
    uint8_t type;
    uint8_t pattern;
    uint16_t length;
    uint8_t frequency;
    uint16_t interval;
    uint32_t numPackets;
    uint8_t credits;
} datapump_transmit_parameters_t;

typedef struct __attribute__((packed)) _datapump_receive_parameters
{
    uint16_t connHandle;
    uint32_t reportInterval;
} datapump_receive_parameters_t;

typedef struct __attribute__((packed)) _datapump_end_parameters
{
    uint16_t connHandle;
} datapump_end_parameters_t;

typedef struct __attribute__((packed)) _datapump_read_report_parameters
{
    uint16_t connHandle;
} datapump_read_report_parameters_t;

enum
{
    kDATAPUMP_Status_Success           = 0,
    kDATAPUMP_Status_Invalid_Param     = 1,
    kDATAPUMP_Status_Disallowed        = 2,
    kDATAPUMP_Status_Capacity_Exceeded = 3,
    kDATAPUMP_Status_Unknown_Conn_Id   = 4,
};

typedef struct __attribute__((packed))
{
    uint8_t status;
    uint16_t connHandle;
} general_status_datapump_t;

typedef struct __attribute__((packed))
{
    uint8_t status;
    uint16_t connHandle;
    uint32_t numPacketsTx;
    uint32_t numPacketsRx;
    uint32_t throughput;
} report_status_datapump_t;

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/* Function called before main is entered */
int DatapumpPreMainInit(void) __attribute__((constructor));

static void DATAPUMP_TimerCb(uint32_t flags);
static ble_stat_t DatapumpCallEnable(uint8_t nbOfInParams,
                                     uint8_t *in_params,
                                     uint8_t *evnt_pckt_p,
                                     uint8_t *out_params_length,
                                     hci_return_command_type *return_command_type);
static ble_stat_t DatapumpCallDisable(uint8_t nbOfInParams,
                                      uint8_t *in_params,
                                      uint8_t *evnt_pckt_p,
                                      uint8_t *out_params_length,
                                      hci_return_command_type *return_command_type);
static ble_stat_t DatapumpCallTransmit(uint8_t nbOfInParams,
                                       uint8_t *in_params,
                                       uint8_t *evnt_pckt_p,
                                       uint8_t *out_params_length,
                                       hci_return_command_type *return_command_type);
static ble_stat_t DatapumpCallReceive(uint8_t nbOfInParams,
                                      uint8_t *in_params,
                                      uint8_t *evnt_pckt_p,
                                      uint8_t *out_params_length,
                                      hci_return_command_type *return_command_type);
static ble_stat_t DatapumpCallReadReport(uint8_t nbOfInParams,
                                         uint8_t *in_params,
                                         uint8_t *evnt_pckt_p,
                                         uint8_t *out_params_length,
                                         hci_return_command_type *return_command_type);
static ble_stat_t DatapumpCallEnd(uint8_t nbOfInParams,
                                  uint8_t *in_params,
                                  uint8_t *evnt_pckt_p,
                                  uint8_t *out_params_length,
                                  hci_return_command_type *return_command_type);
static void DatapumpInit(void);

/*******************************************************************************
 * Variables
 ******************************************************************************/
static bool s_isInitialized;
static datapump_context_t s_contexts[MAX_CONN];
static acl_packet_t s_acl[MAX_ACL_DATA_BUFFER];
static int s_timerIds[MAX_TIMER_CHANNELS] = {
    0}; /* When a timer is in use, the associated s_timerIds[] slot is non zero. */
static uint32_t s_txTimerReferences;
static uint8_t s_dataPattern[MAX_ACL_DATA_BUFFER];
static uint32_t s_aclDataQueue;
static uint8_t s_txTimerId = 255;

static const datapump_ctimer_id_t s_cClockId   = 2; /* Used as a microsecond clock. */
static const datapump_ctimer_id_t s_ctimerIdTx = 1;

static CTIMER_Type *s_ctimers[kDATAPUMP_CTIMER_MAX] = {CTIMER0, CTIMER1,
                                                       CTIMER2}; /* Note that s_ctimers[0] is nowhere used. */

/* Custom commands related to Radio Test Suite */
static const CustomHciCmd customHCIOperations_Datapump[] = {
    {.opcode = GET_OP_CODE(HCI_OCF_DATAPUMP_ENABLE, HCI_OGF_EXT), .nbOfInParams = 0, .func = DatapumpCallEnable},
    {.opcode = GET_OP_CODE(HCI_OCF_DATAPUMP_DISABLE, HCI_OGF_EXT), .nbOfInParams = 0, .func = DatapumpCallDisable},
    {.opcode          = GET_OP_CODE(HCI_OCF_DATAPUMP_TRANSMIT, HCI_OGF_EXT),
     .nbOfInParams = sizeof(datapump_transmit_parameters_t),
     .func            = DatapumpCallTransmit},
    {.opcode          = GET_OP_CODE(HCI_OCF_DATAPUMP_RECEIVE, HCI_OGF_EXT),
     .nbOfInParams = sizeof(datapump_receive_parameters_t),
     .func            = DatapumpCallReceive},
    {.opcode          = GET_OP_CODE(HCI_OCF_DATAPUMP_READ_REPORT, HCI_OGF_EXT),
     .nbOfInParams = sizeof(datapump_read_report_parameters_t),
     .func            = DatapumpCallReadReport},
    {.opcode          = GET_OP_CODE(HCI_OCF_DATAPUMP_END, HCI_OGF_EXT),
     .nbOfInParams = sizeof(datapump_end_parameters_t),
     .func            = DatapumpCallEnd}};

