nxp-mcuxpresso/mcuxsdk-examples/wireless_examples/ble_controller/hci_bb_mcxw23/hci_bb/datapump.c
/*******************************************************************************
 * Code
 ******************************************************************************/

static void ProgramTimer(datapump_ctimer_id_t ctimerId, ctimer_match_t matchId, uint32_t usec)
{
    CTIMER_Type *base     = s_ctimers[ctimerId];
    uint32_t currentCount = CTIMER_GetTimerCountValue(base);
    uint32_t clockFreqHz  = CLOCK_GetCTimerClkFreq(ctimerId);
    uint32_t count        = USEC_TO_COUNT(usec, clockFreqHz);

    ctimer_match_config_t timerMatchConfig = {.matchValue         = currentCount + count,
                                              .enableCounterReset = false,
                                              .enableCounterStop  = false,
                                              .outControl         = kCTIMER_Output_NoAction,
                                              .outPinInitState    = false,
                                              .enableInterrupt    = true};
    CTIMER_SetupMatch(base, matchId, &timerMatchConfig);
}

static void DATAPUMP_ProgramTxTimer(void)
{
    static const uint32_t txTimerUs = 100000; /* Check every 100ms for jobs. */
    assert(s_txTimerId <= MAX_TIMER_CHANNELS);
    ProgramTimer(s_ctimerIdTx, s_txTimerId, txTimerUs);
}

static transmit_params_t *GetTransmitContext(uint16_t connHandle)
{
    for (int i = 0; i < MAX_CONN; i++)
    {
        if (s_contexts[i].inUse == kTransmitContext && (s_contexts[i].transmit.connHandle == connHandle))
        {
            return &s_contexts[i].transmit;
        }
    }
    return NULL;
}

static receive_params_t *GetReceiveContext(uint16_t connHandle)
{
    for (int i = 0; i < MAX_CONN; i++)
    {
        if (s_contexts[i].inUse == kReceiveContext && (s_contexts[i].receive.connHandle == connHandle))
        {
            return &s_contexts[i].receive;
        }
    }
    return NULL;
}

static receive_params_t *GetReceiveContextFromTimerId(uint8_t timerId)
{
    for (int i = 0; i < MAX_CONN; i++)
    {
        if (s_contexts[i].inUse == kReceiveContext && (s_contexts[i].receive.timerId == timerId))
        {
            return &s_contexts[i].receive;
        }
    }
    return NULL;
}

static status_t DATAPUMP_AllocateTimerId(uint8_t *timerId)
{
    status_t status = kStatus_Fail;
    for (int i = 0; i < MAX_TIMER_CHANNELS; i++)
    {
        if (!s_timerIds[i]) /* Zero value for s_timerIds[x] means it is not in use. */
        {
            *timerId      = i;
            s_timerIds[i] = 1; /* Mark it in use. */
            status        = kStatus_Success;
            break;
        }
    }
    return status;
}

static uint32_t DATAPUMP_GetTimeUs(void)
{
    CTIMER_Type *base    = s_ctimers[s_cClockId];
    uint32_t clockFreqHz = CLOCK_GetCTimerClkFreq(s_cClockId);
    return COUNT_TO_USEC(CTIMER_GetTimerCountValue(base), clockFreqHz);
}

static void DATAPUMP_FreeTimer(uint8_t timerId)
{
    s_timerIds[timerId]                    = 0; /* Mark no longer in use. */
    ctimer_match_config_t timerMatchConfig = {NO_TIMER_EVENT, false, false, kCTIMER_Output_NoAction, false, false};
    CTIMER_Type *timer                     = s_ctimers[s_cClockId];

    CTIMER_RegisterCallBack(timer, (ctimer_callback_t *)DATAPUMP_TimerCb, kCTIMER_SingleCallback);
    CTIMER_SetupMatch(timer, timerId, &timerMatchConfig);
}

static void DATAPUMP_TimerInit(datapump_ctimer_id_t ctimerId)
{
    ctimer_config_t timerConfig;
    ctimer_match_config_t timerMatchConfig = {NO_TIMER_EVENT, false, false, kCTIMER_Output_NoAction, false, false};
    CTIMER_Type *base                      = s_ctimers[ctimerId];

    /* Set up timer */
    CTIMER_GetDefaultConfig(&timerConfig);

    CTIMER_Init(base, &timerConfig);

    CTIMER_RegisterCallBack(base, NULL, kCTIMER_SingleCallback);

    CTIMER_SetupMatch(base, kCTIMER_Match_0, &timerMatchConfig);

    /* Start timer */
    CTIMER_StartTimer(base);
}

static void DATAPUMP_TimerDeInit(datapump_ctimer_id_t ctimerId)
{
    CTIMER_Deinit(s_ctimers[ctimerId]);
}

static void DATAPUMP_End(uint16_t connHandle)
{
    transmit_params_t *transmitDatapump = GetTransmitContext(connHandle);
    receive_params_t *receiveDatapump   = GetReceiveContext(connHandle);

    if (receiveDatapump != NULL)
    {
        if (receiveDatapump->reportInterval != 0)
        {
            DATAPUMP_FreeTimer(receiveDatapump->timerId);
        }
        memset(receiveDatapump, 0, sizeof(receive_params_t));
    }

    if (transmitDatapump != NULL)
    {
        if (s_txTimerReferences > 0)
        {
            if (--s_txTimerReferences == 0)
            {
                DATAPUMP_FreeTimer(s_txTimerId);
                s_txTimerId = 255;
            }
        }

        memset(transmitDatapump, 0, sizeof(transmit_params_t));
    }
}

static void DATAPUMP_UnRegisterTapHciPacketCallback()
{
    ll_uart_unregister_write_prefilter();
}

static void DATAPUMP_DisableEvent()
{
    DATAPUMP_UnRegisterTapHciPacketCallback();
    DATAPUMP_TimerDeInit(s_ctimerIdTx);
    DATAPUMP_TimerDeInit(s_cClockId);
}

static void Mem_Copy_Per_Byte(uint8_t *dst, uint8_t *src, uint32_t size)
{
    for (uint32_t i = 0; i < size; i++)
    {
        dst[i] = src[i];
    }
}

static void DATAPUMP_Transmit(transmit_params_t *transmit)
{
    if (transmit->stopTransmit == false)
    {
        while (transmit->credits > 0)
        {
            /* The following is a hack to work around the compiler warning of taking the address out of an unaligned
             * structure. */
            packet_info_t *info                    = (packet_info_t *)(void *)&s_acl[s_aclDataQueue].pad[2];
            s_acl[s_aclDataQueue].connectionHandle = transmit->connHandle;
            s_acl[s_aclDataQueue].dataTotalLength  = transmit->length;
            info->sentTimestamp                    = DATAPUMP_GetTimeUs();
            info->sequenceNumber                   = transmit->numPacketsSend;
            ble_buff_hdr_t *ble_buff_hdr           = (ble_buff_hdr_t *)hci_alloc_msg();
            assert(ble_buff_hdr != NULL);
            ble_buff_hdr->data_size  = sizeof(s_acl[0]) - sizeof(s_acl[0].lc);
            ble_buff_hdr->buff_start = ll_intf_alloc_ll_pkt();
            if (ble_buff_hdr->buff_start == NULL)
            {
                PRINTF("Could not allocate Cmd Buffer\n");
                assert(false);
            }

            Mem_Copy_Per_Byte(ble_buff_hdr->buff_start, (uint8_t *)&s_acl[s_aclDataQueue] + sizeof(s_acl[0].lc),
                              transmit->length);

            ble_buff_hdr->ble_hdr_flags = BLE_BUFF_HDR_ACL_DATA_PCKT;

