nxp-mcuxpresso/mcuxsdk-examples/wireless_examples/ble_controller/hci_bb_mcxw23/hci_bb/datapump.c
            int ret = emngr_post_event(HCI_HANDLER, ble_buff_hdr);
#ifdef DEBUG_DATAPUMP
            GPIO->NOT[0] = 1U << 20;
#endif
            if (ret != 0)
            {
                if (ret == HANDLE_IS_FULL)
                {
                    PRINTF("Handle is full\n");
                    assert(false);
                }
                else
                {
                    PRINTF("Unknown error\n");
                    assert(false);
                }
            }
            else
            {
                transmit->credits -= 1; /* Only decrement when successful. */
                transmit->numPacketsSend += 1;
            }

            s_aclDataQueue = (s_aclDataQueue + 1) % MAX_ACL_DATA_BUFFER;
        }
    }
}

static void DATAPUMP_GenerateReport(uint16_t connHandle, report_status_datapump_t *status)
{
    status->status                      = kDATAPUMP_Status_Unknown_Conn_Id;
    status->numPacketsRx                = 0;
    status->numPacketsTx                = 0;
    status->throughput                  = 0;
    status->connHandle                  = connHandle;
    receive_params_t *receiveDatapump   = GetReceiveContext(connHandle);
    transmit_params_t *transmitDatapump = GetTransmitContext(connHandle);
    if (receiveDatapump != NULL)
    {
        status->status       = kDATAPUMP_Status_Success;
        status->numPacketsRx = receiveDatapump->numPackets;
        uint32_t currentTime = DATAPUMP_GetTimeUs();
        uint32_t diff        = DIFF(currentTime, receiveDatapump->timestamp);

        // Throughput is expressed in bits/second; notice that diff is expressed in microseconds.
        // formula:         (bytes*8)/ (diff/1e6)
        // using integers:  (bytes*8) *1e6 / diff
        // As this gives an overflow of a 32-bit number, we divide both numerator and denominator with 512:
        // bytes * (8 * 1e6 / 512) / (diff/512)

        status->throughput = (receiveDatapump->numberOfBytes * 15625) / (diff >> 9);

        receiveDatapump->timestamp     = DATAPUMP_GetTimeUs();
        receiveDatapump->numberOfBytes = 0;
    }
    if (transmitDatapump != NULL)
    {
        status->status       = kDATAPUMP_Status_Success;
        status->numPacketsTx = transmitDatapump->numPacketsSend;
    }
}

static void DATAPUMP_SendAutonomousReport(uint16_t connHandle)
{
    report_status_datapump_t report;

    DATAPUMP_GenerateReport(connHandle, &report);

    uint8_t *evnt_pckt_p = os_mem_pool_alloc(os_Pool(hci_buffer_t));
    assert(evnt_pckt_p != NULL);

    ble_buff_hdr_t *ptr_buff_hdr = (ble_buff_hdr_t *)hci_alloc_msg();
    assert(ptr_buff_hdr != NULL);

    ptr_buff_hdr->buff_start    = evnt_pckt_p;
    ptr_buff_hdr->data_size     = sizeof(report) + 2; // content size + evnt_code + total len
    ptr_buff_hdr->data_offset   = 0;
    ptr_buff_hdr->ble_hdr_flags = BLE_BUFF_HDR_EVNT_CMD_PCKT;

    evnt_pckt_p[0] = 0xFE;           // custom evnt_code
    evnt_pckt_p[1] = sizeof(report); // Parameter total length for the parameters contained in the HCI event packet
    evnt_pckt_p[2] = report.status;
    WRITE_2_BYTES(evnt_pckt_p, 3, report.connHandle);
    WRITE_4_BYTES(evnt_pckt_p, 5, report.numPacketsTx);
    WRITE_4_BYTES(evnt_pckt_p, 9, report.numPacketsRx);
    WRITE_4_BYTES(evnt_pckt_p, 13, report.throughput);

    hci_transport_send_pckt(ptr_buff_hdr);
}

static bool DATAPUMP_ProcessAclPacket(const acl_packet_t *aclPacket)
{
    bool ret              = true;
    receive_params_t *rxp = GetReceiveContext(aclPacket->connectionHandle);

    if (rxp == NULL)
    {
        ret = false;
    }
    else
    {
        rxp->numPackets += 1;

        if (0 == rxp->timestamp)
        {
            rxp->timestamp = DATAPUMP_GetTimeUs();
        }

        rxp->numberOfBytes += aclPacket->dataTotalLength;

        packet_info_t Info;

        memcpy(&Info, &aclPacket->pad[2],
               sizeof(packet_info_t)); /* To overcome alignment issues, bytecopy into local struct. */

        if (Info.sequenceNumber != rxp->expSequenceNumber)
        {
            PRINTF("ERROR expected %u but got %u\n", rxp->expSequenceNumber, Info.sequenceNumber);
        }

        rxp->expSequenceNumber++;
    }
    return ret;
}

static bool DATAPUMP_ProcessCompletedPackets(const completed_packets_t *completedPackets)
{
    bool ret                            = true;
    transmit_params_t *transmitDatapump = GetTransmitContext(completedPackets->connHandle);

    if (transmitDatapump == NULL)
    {
        ret = false;
    }
    else
    {
#ifdef DEBUG_DATAPUMP
        for (int i = 0; i < completedPackets->numCompletedPackets; i++)
        {
            volatile uint8_t j;
            GPIO->NOT[0] = 1U << 22;
            for (j = 0; j < 2; j++)
            {
            }
        }
#endif
        transmitDatapump->credits += completedPackets->numCompletedPackets;

        if (transmitDatapump->frequency != PAYLOAD_FREQUENCY_PERIODIC)
        {
            DATAPUMP_Transmit(transmitDatapump);
        }
    }

    return ret;
}

static bool DATAPUMP_ProcessDisconnectComplete(uint16_t connHandle)
{
    bool ret                            = true;
    transmit_params_t *transmitDatapump = GetTransmitContext(connHandle);
    if (transmitDatapump == NULL)
    {
        ret = false;
    }
    else
    {
        transmitDatapump->stopTransmit = true;
    }

    return ret;
}

static void DATAPUMP_CheckTransmitJobs(void)
{
    for (int i = 0; i < MAX_CONN; i++)
    {
        transmit_params_t *transmit = &s_contexts[i].transmit;
        if (s_contexts[i].inUse == kTransmitContext && (transmit->frequency == PAYLOAD_FREQUENCY_PERIODIC))
        {
            transmit->delay++;
            if (transmit->delay >= transmit->interval)
            {
                transmit->delay = 0;
                DATAPUMP_Transmit(transmit);
            }
        }
    }
}

static void DATAPUMP_TransmitTimeoutCb(void)
{
    DATAPUMP_CheckTransmitJobs();
    DATAPUMP_ProgramTxTimer(); /* Rearm the transmit timer. */
}

