nxp-mcuxpresso/mcuxsdk-examples/wireless_examples/ble_controller/hci_bb_mcxw23/hci_bb/datapump.c
/*
   The CTIMER implementation will call this function when a timer match occurs; the
   passed flags argument has a 1 bit for the corresponding timer that fired.
*/
static void DATAPUMP_ProcessEventTimer(uint32_t flags)
{
    for (int timerId = 0; timerId < MAX_TIMER_CHANNELS; timerId++)
    {
        if ((flags >> timerId) & 0x1)
        {
            if (timerId == s_txTimerId)
            {
#ifdef DEBUG_DATAPUMP
                PRINTF("TX\n");
#endif
                DATAPUMP_TransmitTimeoutCb();
            }
            else
            {
                receive_params_t *rxp = GetReceiveContextFromTimerId(timerId);
                if (rxp)
                {
                    ProgramTimer(s_cClockId, rxp->timerId, rxp->reportInterval);
                    DATAPUMP_SendAutonomousReport(rxp->connHandle);
                }
#ifdef DEBUG_DATAPUMP
                PRINTF("RX\n");
#endif
            }
        }
    }
}

static bool DATAPUMP_HciPacketReceived(uint8_t *hciPacket, uint16_t size)
{
    bool returnVal = true;
    assert(size > 0);
    acl_packet_t *aclPacket                   = ((acl_packet_t *)(hciPacket));
    completed_packets_t *completedPacket      = ((completed_packets_t *)(hciPacket));
    disconnect_complete_t *disconnectComplete = ((disconnect_complete_t *)(hciPacket));
#ifdef DEBUG_DATAPUMP
    PRINTF("PR-");
#endif
    assert((hciPacket[0] == HCI_EVENT) || (hciPacket[0] == HCI_ACL));

    if (aclPacket->lc == HCI_ACL)
    {
#ifdef DEBUG_DATAPUMP
        PRINTF("ACL\n");
#endif
        returnVal = DATAPUMP_ProcessAclPacket(aclPacket);
    }
    else if ((completedPacket->lc == HCI_EVENT))
    {
#ifdef DEBUG_DATAPUMP
        PRINTF("EVT:");
#endif
        if (completedPacket->eventCode == NUMBER_OF_COMPLETED_PACKETS_EVENT)
        {
#ifdef DEBUG_DATAPUMP
            PRINTF("CP\n");
#endif
            returnVal = DATAPUMP_ProcessCompletedPackets(completedPacket);
        }
        else if (disconnectComplete->eventCode == DISCONNECT_COMPLETE_EVENT)
        {
#ifdef DEBUG_DATAPUMP
            PRINTF("DC\n");
#endif
            returnVal = DATAPUMP_ProcessDisconnectComplete(disconnectComplete->connHandle);
        }
        else
        {
#ifdef DEBUG_DATAPUMP
            PRINTF("UE\n");
#endif
            returnVal = false;
        }
    }
    else
    {
#ifdef DEBUG_DATAPUMP
        PRINTF("UP\n");
#endif
        returnVal = false;
    }

    return returnVal;
}

hci_uart_prefilter_t DATAPUMP_SerialOutPrefilter(uint8_t *buffer, uint16_t size)
{
    bool processed = DATAPUMP_HciPacketReceived(buffer, size);
    return processed ? kPREFILTER_BLOCK_SENDING : kPREFILTER_ALLOW_SENDING;
}

static void DATAPUMP_RegisterTapHciPacketCallback()
{
    ll_uart_register_write_prefilter(DATAPUMP_SerialOutPrefilter);
}

static void DATAPUMP_TimerCb(uint32_t flags)
{
#ifdef DEBUG_DATAPUMP
    PRINTF("T:\n");
#endif
    DATAPUMP_ProcessEventTimer(flags);
}

static void DatapumpInit(void)
{
    for (int i = 0; i < MAX_ACL_DATA_BUFFER; i++)
    {
        s_acl[i].lc      = HCI_ACL;
        s_acl[i].PB_Flag = 0;
        s_acl[i].BC_Flag = 0;
    }
    s_dataPattern[0] = 0x11;
    s_dataPattern[1] = 0x22;
    s_dataPattern[2] = 0x33;
    s_dataPattern[3] = 0x44;
    s_dataPattern[4] = 0x55;
    s_dataPattern[5] = 0x66;
    s_dataPattern[6] = 0x77;
    s_dataPattern[7] = 0x88;
    s_aclDataQueue   = 0;

    for (uint32_t i = 0; i < MAX_ACL_DATA_BUFFER; i++)
    {
        memset(s_acl[i].data, s_dataPattern[i], sizeof(s_acl[i].data));
    }
}

static void DatapumpEnable(void)
{
#ifdef DEBUG_DATAPUMP
    PRINTF("%s\n", __FUNCTION__);
#endif

    if (!s_isInitialized)
    {
        DatapumpInit();
        s_isInitialized = 1;
    }

    DATAPUMP_RegisterTapHciPacketCallback();

    DATAPUMP_TimerInit(s_cClockId);
    DATAPUMP_TimerInit(s_ctimerIdTx);
}

static void DatapumpDisable(void)
{
#ifdef DEBUG_DATAPUMP
    PRINTF("%s\n", __FUNCTION__);
#endif
    DATAPUMP_DisableEvent();
}

static void DatapumpTransmit(datapump_transmit_parameters_t *p)
{
#ifdef DEBUG_DATAPUMP
    PRINTF("%s\n", __FUNCTION__);
#endif
    assert(p != NULL);

    general_status_datapump_t status;
    status.status     = kDATAPUMP_Status_Success;
    status.connHandle = p->connHandle;

    // check if all the parameters are right
    if ((p->type > PAYLOAD_TYPE_RANDOM_LENGTH) || (p->pattern > PAYLOAD_PATTERN_RANDOM_DATA) ||
        (p->frequency > PAYLOAD_FREQUENCY_PERIODIC))
    {
        status.status = kDATAPUMP_Status_Invalid_Param;
    }
    if (GetTransmitContext(p->connHandle) != NULL)
    {
        status.status = kDATAPUMP_Status_Disallowed;
    }

    if (status.status == kDATAPUMP_Status_Success)
    {
        int i;

        /* If there is still a transmit datapump available, configure the parameters of that datapump. */
        transmit_params_t *txp = &s_contexts[0].transmit;
        for (i = 0; i < MAX_CONN; i++, txp++)
        {
            if (!s_contexts[i].inUse)
            {
                s_contexts[i].inUse = kTransmitContext;
                txp->connHandle     = p->connHandle;
                txp->type           = p->type;
                txp->pattern        = p->pattern;
                txp->length         = p->length;
                txp->frequency      = p->frequency;
                txp->interval       = p->interval;
                txp->numPackets     = p->numPackets;
                txp->credits        = p->credits;
                txp->numPacketsSend = 0;
                txp->timerId        = 0;
                txp->delay          = 0;

                /*
                  Notes about the s_txTimerId;
                  - there is at most 1 transmit timer active; indicated by the s_txTimerReferences count.
                  - it is assigned one of the available, if any, timer ids in the s_timerIds[] array.
                */

                if (p->frequency == PAYLOAD_FREQUENCY_PERIODIC)
                {
                    if (s_txTimerReferences == 0)
                    {
                        if (DATAPUMP_AllocateTimerId(&s_txTimerId) != kDATAPUMP_Status_Success)
                        {
                            status.status = kDATAPUMP_Status_Capacity_Exceeded;
                        }
                        else
                        {
                            /*                                VVVVVVVVVVVV is wrong since s_ctimerIdTx can be 3. */
                            // CTIMER_RegisterCallBack(s_ctimers[s_ctimerIdTx], (ctimer_callback_t *)DATAPUMP_TimerCb,
                            // kCTIMER_SingleCallback);
                            CTIMER_RegisterCallBack(s_ctimers[s_cClockId], (ctimer_callback_t *)DATAPUMP_TimerCb,
                                                    kCTIMER_SingleCallback);
                            DATAPUMP_ProgramTxTimer();
                        }
                    }
                    s_txTimerReferences++;
                }

                DATAPUMP_Transmit(txp);

                break;
            }
        }
        if (i == MAX_CONN)
        {
            status.status = kDATAPUMP_Status_Capacity_Exceeded;
        }
    }
}

static void DatapumpReceive(datapump_receive_parameters_t *params)
{
#ifdef DEBUG_DATAPUMP
    PRINTF("%s\n", __FUNCTION__);
#endif
    assert(params != NULL);

