nxp-mcuxpresso/mcuxsdk-examples/wireless_examples/ble_controller/hci_bb_mcxw23/hci_bb/datapump.c
    uint16_t connHandle     = ((datapump_receive_parameters_t *)params)->connHandle;
    uint32_t reportInterval = ((datapump_receive_parameters_t *)params)->reportInterval * 1000;
    uint8_t timerId         = 0;

    general_status_datapump_t status;
    status.status     = kDATAPUMP_Status_Success;
    status.connHandle = connHandle;

    if (GetReceiveContext(connHandle) != NULL)
    {
        status.status = kDATAPUMP_Status_Disallowed;
    }

    // before reserving a datapump check if the datapump needs a timer for autonomous reporting
    if ((reportInterval >= MIN_REPORT_INTERVAL) && (reportInterval <= MAX_REPORT_INTERVAL))
    {
        if (DATAPUMP_AllocateTimerId(&timerId) != kDATAPUMP_Status_Success)
        {
            status.status = kDATAPUMP_Status_Capacity_Exceeded;
        }
    }
    else if (reportInterval != 0)
    {
        status.status = kDATAPUMP_Status_Invalid_Param;
    }

    if (status.status == kDATAPUMP_Status_Success)
    {
        int i;
        /* If there is still a receive datapump available, configure the parameters of that datapump. */
        receive_params_t *rxp = &s_contexts[0].receive;
        for (i = 0; i < MAX_CONN; i++, rxp++)
        {
            if (!s_contexts[i].inUse)
            {
                s_contexts[i].inUse = kReceiveContext;
                rxp->connHandle     = connHandle;
                rxp->reportInterval = reportInterval;
                rxp->numPackets     = 0;
                rxp->numberOfBytes  = 0;
                rxp->timestamp      = 0;
                rxp->timerId        = timerId;

                if (rxp->reportInterval != 0)
                {
                    CTIMER_RegisterCallBack(s_ctimers[s_cClockId], (ctimer_callback_t *)DATAPUMP_TimerCb,
                                            kCTIMER_SingleCallback);
                    ProgramTimer(s_cClockId, timerId, reportInterval);
                }

                break;
            }
        }
        if (i == MAX_CONN)
        {
            status.status = kDATAPUMP_Status_Capacity_Exceeded;
        }
    }
}

static void DatapumpEnd(datapump_end_parameters_t *params)
{
#ifdef DEBUG_DATAPUMP
    PRINTF("%s\n", __FUNCTION__);
#endif
    assert(params != NULL);

    DATAPUMP_End(params->connHandle);
}

static void DatapumpReadReport(datapump_read_report_parameters_t *params, report_status_datapump_t *status)
{
#ifdef DEBUG_DATAPUMP
    PRINTF("%s\n", __FUNCTION__);
#endif
    assert(params != NULL);
    DATAPUMP_GenerateReport(params->connHandle, status);
}

static ble_stat_t DatapumpCallEnable(uint8_t nbOfInParams,
                                     uint8_t *in_params,
                                     uint8_t *evnt_pckt_p,
                                     uint8_t *out_params_length,
                                     hci_return_command_type *return_command_type)
{
    DatapumpEnable();
    return SUCCESS;
}

static ble_stat_t DatapumpCallDisable(uint8_t nbOfInParams,
                                      uint8_t *in_params,
                                      uint8_t *evnt_pckt_p,
                                      uint8_t *out_params_length,
                                      hci_return_command_type *return_command_type)
{
    DatapumpDisable();
    return SUCCESS;
}

static ble_stat_t DatapumpCallTransmit(uint8_t nbOfInParams,
                                       uint8_t *in_params,
                                       uint8_t *evnt_pckt_p,
                                       uint8_t *out_params_length,
                                       hci_return_command_type *return_command_type)
{
    datapump_transmit_parameters_t transmit_params;
    transmit_params.connHandle = READ_2_BYTES(in_params, 0);
    transmit_params.type       = in_params[2];
    transmit_params.pattern    = in_params[3];
    transmit_params.length     = READ_2_BYTES(in_params, 4);
    transmit_params.frequency  = in_params[6];
    transmit_params.interval   = READ_2_BYTES(in_params, 7);
    transmit_params.numPackets = READ_4_BYTES(in_params, 9);
    transmit_params.credits    = in_params[13];
    DatapumpTransmit(&transmit_params);
    return SUCCESS;
}

static ble_stat_t DatapumpCallReceive(uint8_t nbOfInParams,
                                      uint8_t *in_params,
                                      uint8_t *evnt_pckt_p,
                                      uint8_t *out_params_length,
                                      hci_return_command_type *return_command_type)
{
    datapump_receive_parameters_t receive_params;
    receive_params.connHandle     = READ_2_BYTES(in_params, 0);
    receive_params.reportInterval = READ_4_BYTES(in_params, 2);
    DatapumpReceive(&receive_params);
    return SUCCESS;
}

static ble_stat_t DatapumpCallReadReport(uint8_t nbOfInParams,
                                         uint8_t *in_params,
                                         uint8_t *evnt_pckt_p,
                                         uint8_t *out_params_length,
                                         hci_return_command_type *return_command_type)
{
    datapump_read_report_parameters_t read_report_params;
    read_report_params.connHandle = READ_2_BYTES(in_params, 0);

    report_status_datapump_t status;
    DatapumpReadReport(&read_report_params, &status);

    *out_params_length   = sizeof(status);
    *return_command_type = HCI_RETURN_COMMAND_TYPE_COMPLETE;

    evnt_pckt_p[0] = status.status;
    WRITE_2_BYTES(evnt_pckt_p, 1, status.connHandle);
    WRITE_4_BYTES(evnt_pckt_p, 3, status.numPacketsTx);
    WRITE_4_BYTES(evnt_pckt_p, 7, status.numPacketsRx);
    WRITE_4_BYTES(evnt_pckt_p, 11, status.throughput);

    return SUCCESS;
}

static ble_stat_t DatapumpCallEnd(uint8_t nbOfInParams,
                                  uint8_t *in_params,
                                  uint8_t *evnt_pckt_p,
                                  uint8_t *out_params_length,
                                  hci_return_command_type *return_command_type)
{
    datapump_end_parameters_t end_params;
    end_params.connHandle = READ_2_BYTES(in_params, 0);
    DatapumpEnd(&end_params);
    return SUCCESS;
}

int DatapumpPreMainInit(void)
{
    int res;
    (void)res;
    /* Extend custom commannd array */
    res = HCICUSTOMCMD_Register(customHCIOperations_Datapump,
                                sizeof(customHCIOperations_Datapump) / sizeof(customHCIOperations_Datapump[0]));
    assert(res == 0);
    return 0;
}
